zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommi2ct.h
/* UNICOMMI2CT_SPGDMATXSA Bits */
/* UNICOMMI2CT_SPGDMATXSA[ADDR] Bits */
#define UNICOMMI2CT_SPGDMATXSA_ADDR_OFS          (0)                             /* !< ADDR Offset */
#define UNICOMMI2CT_SPGDMATXSA_ADDR_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define UNICOMMI2CT_SPGDMATXSA_ADDR_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CT_SPGDMATXSA_ADDR_MAXIMUM      ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* UNICOMMI2CT_SPGDMATXSZ Bits */
/* UNICOMMI2CT_SPGDMATXSZ[SIZE] Bits */
#define UNICOMMI2CT_SPGDMATXSZ_SIZE_OFS          (0)                             /* !< SIZE Offset */
#define UNICOMMI2CT_SPGDMATXSZ_SIZE_MASK         ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define UNICOMMI2CT_SPGDMATXSZ_SIZE_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CT_SPGDMATXSZ_SIZE_MAXIMUM      ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UNICOMMI2CT_DMA_TRIG0_IMASK Bits */
/* UNICOMMI2CT_DMA_TRIG0_IMASK[TXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG0_IMASK_TXTRG_OFS    (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG0_IMASK_TXTRG_MASK   ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CT_DMA_TRIG0_IMASK_TXTRG_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG0_IMASK_TXTRG_SET    ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_DMA_TRIG0_RIS Bits */
/* UNICOMMI2CT_DMA_TRIG0_RIS[TXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG0_RIS_TXTRG_OFS      (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG0_RIS_TXTRG_MASK     ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CT_DMA_TRIG0_RIS_TXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG0_RIS_TXTRG_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_DMA_TRIG0_MIS Bits */
/* UNICOMMI2CT_DMA_TRIG0_MIS[TXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG0_MIS_TXTRG_OFS      (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG0_MIS_TXTRG_MASK     ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CT_DMA_TRIG0_MIS_TXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG0_MIS_TXTRG_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_DMA_TRIG0_ISET Bits */
/* UNICOMMI2CT_DMA_TRIG0_ISET[TXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG0_ISET_TXTRG_OFS     (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG0_ISET_TXTRG_MASK    ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CT_DMA_TRIG0_ISET_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG0_ISET_TXTRG_SET     ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_DMA_TRIG1_IMASK Bits */
/* UNICOMMI2CT_DMA_TRIG1_IMASK[RXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG1_IMASK_RXTRG_OFS    (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG1_IMASK_RXTRG_MASK   ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CT_DMA_TRIG1_IMASK_RXTRG_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG1_IMASK_RXTRG_SET    ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_DMA_TRIG1_RIS Bits */
/* UNICOMMI2CT_DMA_TRIG1_RIS[RXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG1_RIS_RXTRG_OFS      (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG1_RIS_RXTRG_MASK     ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CT_DMA_TRIG1_RIS_RXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG1_RIS_RXTRG_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_DMA_TRIG1_MIS Bits */
/* UNICOMMI2CT_DMA_TRIG1_MIS[RXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG1_MIS_RXTRG_OFS      (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG1_MIS_RXTRG_MASK     ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CT_DMA_TRIG1_MIS_RXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG1_MIS_RXTRG_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_DMA_TRIG1_ISET Bits */
/* UNICOMMI2CT_DMA_TRIG1_ISET[RXTRG] Bits */
#define UNICOMMI2CT_DMA_TRIG1_ISET_RXTRG_OFS     (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CT_DMA_TRIG1_ISET_RXTRG_MASK    ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CT_DMA_TRIG1_ISET_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CT_DMA_TRIG1_ISET_RXTRG_SET     ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CT_IIDX Bits */
/* UNICOMMI2CT_IIDX[STAT] Bits */
#define UNICOMMI2CT_IIDX_STAT_OFS                (0)                             /* !< STAT Offset */
#define UNICOMMI2CT_IIDX_STAT_MASK               ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define UNICOMMI2CT_IIDX_STAT_NO_INTR            ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define UNICOMMI2CT_IIDX_STAT_RXDONEFG           ((uint32_t)0x00000001U)         /* !< Receive Done Flag */
#define UNICOMMI2CT_IIDX_STAT_TXDONEFG           ((uint32_t)0x00000002U)         /* !< Transmit Done Flag */
#define UNICOMMI2CT_IIDX_STAT_RXTRG              ((uint32_t)0x00000003U)         /* !< receive FIFO Trigger Level */
#define UNICOMMI2CT_IIDX_STAT_TXTRG              ((uint32_t)0x00000004U)         /* !< transmit FIFO Trigger level */
#define UNICOMMI2CT_IIDX_STAT_RXFULL             ((uint32_t)0x00000005U)         /* !< RX FIFO FULL Event/interrupt
                                                                                    pending */
#define UNICOMMI2CT_IIDX_STAT_TXEMPTY            ((uint32_t)0x00000006U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    Event/interrupt pending */
#define UNICOMMI2CT_IIDX_STAT_TX_UNFL            ((uint32_t)0x00000007U)         /* !< Target TX FIFO underflow */
#define UNICOMMI2CT_IIDX_STAT_RX_OVFL            ((uint32_t)0x00000008U)         /* !< Target RX FIFO overflow event */
#define UNICOMMI2CT_IIDX_STAT_GENCALL            ((uint32_t)0x00000009U)         /* !< General Call Event */
#define UNICOMMI2CT_IIDX_STAT_STARTFG            ((uint32_t)0x0000000AU)         /* !< Start Event */
#define UNICOMMI2CT_IIDX_STAT_STOPFG             ((uint32_t)0x0000000BU)         /* !< Stop Event */
#define UNICOMMI2CT_IIDX_STAT_PEC_RX_ERR         ((uint32_t)0x0000000CU)         /* !< PEC receive error event */
#define UNICOMMI2CT_IIDX_STAT_TIMEOUTA           ((uint32_t)0x0000000DU)         /* !< Timeout A Event */
#define UNICOMMI2CT_IIDX_STAT_TIMEOUTB           ((uint32_t)0x0000000EU)         /* !< Timeout B Event */
#define UNICOMMI2CT_IIDX_STAT_DMA_DONE_RX        ((uint32_t)0x00000010U)         /* !< DMA DONE on Channel RX */
#define UNICOMMI2CT_IIDX_STAT_DMA_DONE_TX        ((uint32_t)0x00000011U)         /* !< DMA DONE on Channel TX */
#define UNICOMMI2CT_IIDX_STAT_ARBLOSTFG          ((uint32_t)0x00000012U)         /* !< Arbitration Lost */
#define UNICOMMI2CT_IIDX_STAT_DMA_PREIRQ_RX      ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define UNICOMMI2CT_IIDX_STAT_DMA_PREIRQ_TX      ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

