zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommi2ct.h
/* UNICOMMI2CT_CLKSEL Bits */
/* UNICOMMI2CT_CLKSEL[MFCLK_SEL] Bits */
#define UNICOMMI2CT_CLKSEL_MFCLK_SEL_OFS         (2)                             /* !< MFCLK_SEL Offset */
#define UNICOMMI2CT_CLKSEL_MFCLK_SEL_MASK        ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define UNICOMMI2CT_CLKSEL_MFCLK_SEL_DISABLE     ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CT_CLKSEL_MFCLK_SEL_ENABLE      ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* UNICOMMI2CT_CLKSEL[BUSCLK_SEL] Bits */
#define UNICOMMI2CT_CLKSEL_BUSCLK_SEL_OFS        (3)                             /* !< BUSCLK_SEL Offset */
#define UNICOMMI2CT_CLKSEL_BUSCLK_SEL_MASK       ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define UNICOMMI2CT_CLKSEL_BUSCLK_SEL_DISABLE    ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CT_CLKSEL_BUSCLK_SEL_ENABLE     ((uint32_t)0x00000008U)         /* !< Select this clock as a source */
/* UNICOMMI2CT_CLKSEL[ASYNC_SYSCLK_SEL] Bits */
#define UNICOMMI2CT_CLKSEL_ASYNC_SYSCLK_SEL_OFS  (9)                             /* !< ASYNC_SYSCLK_SEL Offset */
#define UNICOMMI2CT_CLKSEL_ASYNC_SYSCLK_SEL_MASK ((uint32_t)0x00000200U)         /* !< Asynchronous sysclk selected as
                                                                                    source */
#define UNICOMMI2CT_CLKSEL_ASYNC_SYSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CT_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE ((uint32_t)0x00000200U)         /* !< Select this clock as a source */
/* UNICOMMI2CT_CLKSEL[ASYNC_HFCLK_SEL] Bits */
#define UNICOMMI2CT_CLKSEL_ASYNC_HFCLK_SEL_OFS   (10)                            /* !< ASYNC_HFCLK_SEL Offset */
#define UNICOMMI2CT_CLKSEL_ASYNC_HFCLK_SEL_MASK  ((uint32_t)0x00000400U)         /* !< Asynchronous HFCLK selected as
                                                                                    source */
#define UNICOMMI2CT_CLKSEL_ASYNC_HFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CT_CLKSEL_ASYNC_HFCLK_SEL_ENABLE ((uint32_t)0x00000400U)         /* !< Select this clock as a source */
/* UNICOMMI2CT_CLKSEL[ASYNC_PLL_SEL] Bits */
#define UNICOMMI2CT_CLKSEL_ASYNC_PLL_SEL_OFS     (11)                            /* !< ASYNC_PLL_SEL Offset */
#define UNICOMMI2CT_CLKSEL_ASYNC_PLL_SEL_MASK    ((uint32_t)0x00000800U)         /* !< Asynchronous PLL selected as source */
#define UNICOMMI2CT_CLKSEL_ASYNC_PLL_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CT_CLKSEL_ASYNC_PLL_SEL_ENABLE  ((uint32_t)0x00000800U)         /* !< Select this clock as a source */

/* UNICOMMI2CT_PDBGCTL Bits */
/* UNICOMMI2CT_PDBGCTL[FREE] Bits */
#define UNICOMMI2CT_PDBGCTL_FREE_OFS             (0)                             /* !< FREE Offset */
#define UNICOMMI2CT_PDBGCTL_FREE_MASK            ((uint32_t)0x00000001U)         /* !< Free run control */
#define UNICOMMI2CT_PDBGCTL_FREE_STOP            ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define UNICOMMI2CT_PDBGCTL_FREE_RUN             ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* UNICOMMI2CT_PDBGCTL[SOFT] Bits */
#define UNICOMMI2CT_PDBGCTL_SOFT_OFS             (1)                             /* !< SOFT Offset */
#define UNICOMMI2CT_PDBGCTL_SOFT_MASK            ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define UNICOMMI2CT_PDBGCTL_SOFT_DEPRECATED      ((uint32_t)0x00000000U)         /* !< Not supported */
#define UNICOMMI2CT_PDBGCTL_SOFT_DELAYED         ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* UNICOMMI2CT_INTCTL Bits */
/* UNICOMMI2CT_INTCTL[INTEVAL] Bits */
#define UNICOMMI2CT_INTCTL_INTEVAL_OFS           (0)                             /* !< INTEVAL Offset */
#define UNICOMMI2CT_INTCTL_INTEVAL_MASK          ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define UNICOMMI2CT_INTCTL_INTEVAL_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define UNICOMMI2CT_INTCTL_INTEVAL_EVAL          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* UNICOMMI2CT_CTR Bits */
/* UNICOMMI2CT_CTR[ENABLE] Bits */
#define UNICOMMI2CT_CTR_ENABLE_OFS               (0)                             /* !< ENABLE Offset */
#define UNICOMMI2CT_CTR_ENABLE_MASK              ((uint32_t)0x00000001U)         /* !< Setting this bit enables the
                                                                                    module. */
#define UNICOMMI2CT_CTR_ENABLE_DISABLE           ((uint32_t)0x00000000U)         /* !< Disables module operation. */
#define UNICOMMI2CT_CTR_ENABLE_ENABLE            ((uint32_t)0x00000001U)         /* !< Enables module operation. */
/* UNICOMMI2CT_CTR[GENCALL] Bits */
#define UNICOMMI2CT_CTR_GENCALL_OFS              (1)                             /* !< GENCALL Offset */
#define UNICOMMI2CT_CTR_GENCALL_MASK             ((uint32_t)0x00000002U)         /* !< General call response enable Modify
                                                                                    only when UCSWRST = 1. 0b = Do not
                                                                                    respond to a general call 1b =
                                                                                    Respond to a general call */
#define UNICOMMI2CT_CTR_GENCALL_DISABLE          ((uint32_t)0x00000000U)         /* !< Do not respond to a general call */
#define UNICOMMI2CT_CTR_GENCALL_ENABLE           ((uint32_t)0x00000002U)         /* !< Respond to a general call */
/* UNICOMMI2CT_CTR[CLKSTRETCH] Bits */
#define UNICOMMI2CT_CTR_CLKSTRETCH_OFS           (20)                            /* !< CLKSTRETCH Offset */
#define UNICOMMI2CT_CTR_CLKSTRETCH_MASK          ((uint32_t)0x00100000U)         /* !< Clock Stretch Enable */
#define UNICOMMI2CT_CTR_CLKSTRETCH_DISABLE       ((uint32_t)0x00000000U)         /* !< clock stretching is disabled */
#define UNICOMMI2CT_CTR_CLKSTRETCH_ENABLE        ((uint32_t)0x00100000U)         /* !< clock stretching is enabled */
/* UNICOMMI2CT_CTR[TXEMPTY_ON_TREQ] Bits */
#define UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_OFS      (3)                             /* !< TXEMPTY_ON_TREQ Offset */
#define UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_MASK     ((uint32_t)0x00000008U)         /* !< Tx Empty Interrupt on TREQ */
#define UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_DISABLE  ((uint32_t)0x00000000U)         /* !< When 0, RIS:TXEMPTY will be set
                                                                                    when only the Target TX FIFO is
                                                                                    empty. This allows the TXEMPTY
                                                                                    interrupt to be used to indicate that
                                                                                    the I2C bus is being clock stretched
                                                                                    and that Target TX data is required. */
#define UNICOMMI2CT_CTR_TXEMPTY_ON_TREQ_ENABLE   ((uint32_t)0x00000008U)         /* !< When 1, RIS:TXEMPTY will be set
                                                                                    when the Target State Machine is in
                                                                                    the TX_WAIT state which occurs when
                                                                                    the TX FIFO is empty AND the I2C
                                                                                    transaction is clock stretched
                                                                                    waiting for the FIFO to receive data. */
/* UNICOMMI2CT_CTR[TXTRIG_TXMODE] Bits */
#define UNICOMMI2CT_CTR_TXTRIG_TXMODE_OFS        (4)                             /* !< TXTRIG_TXMODE Offset */
#define UNICOMMI2CT_CTR_TXTRIG_TXMODE_MASK       ((uint32_t)0x00000010U)         /* !< Tx Trigger when Target FSM is in Tx
                                                                                    Mode */
#define UNICOMMI2CT_CTR_TXTRIG_TXMODE_DISABLE    ((uint32_t)0x00000000U)         /* !< No special behavior */
#define UNICOMMI2CT_CTR_TXTRIG_TXMODE_ENABLE     ((uint32_t)0x00000010U)         /* !< When 1, RIS:TXTRG will be set when
                                                                                    the Target TX FIFO has reached the
                                                                                    trigger level AND the Target State
                                                                                    Machine is in the TXMODE as defined
                                                                                    in the SSR register. When cleared
                                                                                    RIS:TXTRG will be set when the Target
                                                                                    TX FIFO is at or above the trigger
                                                                                    level. This setting can be used to
                                                                                    hold off the TX DMA until a
                                                                                    transaction starts. This allows the
                                                                                    DMA to be configured when the I2C is
                                                                                    idle but have it wait till the
                                                                                    transaction starts to load the Target
                                                                                    TX FIFO, so it can load from a memory
                                                                                    buffer that might be changing over
                                                                                    time. */
/* UNICOMMI2CT_CTR[TXWAIT_STALE_TXFIFO] Bits */
#define UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_OFS  (5)                             /* !< TXWAIT_STALE_TXFIFO Offset */
#define UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_MASK ((uint32_t)0x00000020U)         /* !< Tx transfer waits when stale data
                                                                                    in Tx FIFO. This prevents stale bytes
                                                                                    left in the TX FIFO from
                                                                                    automatically being sent on the next
                                                                                    I2C packet. Note: this should be used
                                                                                    with TXEMPTY_ON_TREQ set to prevent
                                                                                    the Target State Machine from waiting
                                                                                    for TX FIFO data without an interrupt
                                                                                    notification when the FIFO data is
                                                                                    stale. */
#define UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_DISABLE ((uint32_t)0x00000000U)         /* !< When 0, the TX FIFO empty signal to
                                                                                    the Target State Machine indicates
                                                                                    that the TX FIFO is empty. */
#define UNICOMMI2CT_CTR_TXWAIT_STALE_TXFIFO_ENABLE ((uint32_t)0x00000020U)         /* !< When 1, the TX FIFO empty signal to
                                                                                    the Target State Machine will
                                                                                    indicate that the TX FIFO is empty or
                                                                                    that the TX FIFO data is stale. The
                                                                                    TX FIFO data is determined to be
                                                                                    stale when there is data in the TX
                                                                                    FIFO when the Target State Machine
                                                                                    leaves the TXMODE as defined in the
                                                                                    SSR register. This can occur is a
                                                                                    Stop or timeout occur when there are
                                                                                    bytes left in the TX FIFO. */
/* UNICOMMI2CT_CTR[RXFULL_ON_RREQ] Bits */
#define UNICOMMI2CT_CTR_RXFULL_ON_RREQ_OFS       (6)                             /* !< RXFULL_ON_RREQ Offset */
#define UNICOMMI2CT_CTR_RXFULL_ON_RREQ_MASK      ((uint32_t)0x00000040U)         /* !< Rx full interrupt generated on RREQ
                                                                                    condition as indicated in SSR */
#define UNICOMMI2CT_CTR_RXFULL_ON_RREQ_DISABLE   ((uint32_t)0x00000000U)         /* !< When 0, RIS:SRXFULL will be set
                                                                                    when only the Target RX FIFO is full.
                                                                                    This allows the SRXFULL interrupt to
                                                                                    be used to indicate that the I2C bus
                                                                                    is being clock stretched and that the
                                                                                    FW must either read the RX FIFO or
                                                                                    ACK/NACK the current Rx byte. */
#define UNICOMMI2CT_CTR_RXFULL_ON_RREQ_ENABLE    ((uint32_t)0x00000040U)         /* !< When 1, RIS:SRXFULL will be set
                                                                                    when the Target State Machine is in
                                                                                    the RX_WAIT or RX_ACK_WAIT states
                                                                                    which occurs when the I2C transaction
                                                                                    is clock stretched because the RX
                                                                                    FIFO is full or the ACKOEN has been
                                                                                    set and the state machine is waiting
                                                                                    for FW to ACK/NACK the current byte. */
/* UNICOMMI2CT_CTR[EN_DEFHOSTADR] Bits */
#define UNICOMMI2CT_CTR_EN_DEFHOSTADR_OFS        (7)                             /* !< EN_DEFHOSTADR Offset */
#define UNICOMMI2CT_CTR_EN_DEFHOSTADR_MASK       ((uint32_t)0x00000080U)         /* !< Enable Default Host Address */
#define UNICOMMI2CT_CTR_EN_DEFHOSTADR_DISABLE    ((uint32_t)0x00000000U)         /* !< When this bit is 0, the default
                                                                                    host address is not matched NOTE: it
                                                                                    may still be matched if programmed
                                                                                    inside SOAR/SOAR2 */
#define UNICOMMI2CT_CTR_EN_DEFHOSTADR_ENABLE     ((uint32_t)0x00000080U)         /* !< When this bit is 1, default host
                                                                                    address of 7h000_1000 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* UNICOMMI2CT_CTR[EN_ALRESPADR] Bits */
#define UNICOMMI2CT_CTR_EN_ALRESPADR_OFS         (8)                             /* !< EN_ALRESPADR Offset */
#define UNICOMMI2CT_CTR_EN_ALRESPADR_MASK        ((uint32_t)0x00000100U)         /* !< Enable Alert Response Address */
#define UNICOMMI2CT_CTR_EN_ALRESPADR_DISABLE     ((uint32_t)0x00000000U)         /* !< When this bit is 0, the alert
                                                                                    response address is not matched.
                                                                                    NOTE: it may still be matched if
                                                                                    programmed inside SOAR/SOAR2 */
#define UNICOMMI2CT_CTR_EN_ALRESPADR_ENABLE      ((uint32_t)0x00000100U)         /* !< When this bit is 1, alert response
                                                                                    address of 7h000_1100 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* UNICOMMI2CT_CTR[EN_DEFDEVADR] Bits */
#define UNICOMMI2CT_CTR_EN_DEFDEVADR_OFS         (9)                             /* !< EN_DEFDEVADR Offset */
#define UNICOMMI2CT_CTR_EN_DEFDEVADR_MASK        ((uint32_t)0x00000200U)         /* !< Enable Default device address */
#define UNICOMMI2CT_CTR_EN_DEFDEVADR_DISABLE     ((uint32_t)0x00000000U)         /* !< When this bit is 0, the default
                                                                                    device address is not matched. NOTE:
                                                                                    it may still be matched if programmed
                                                                                    inside SOAR/SOAR2. */
#define UNICOMMI2CT_CTR_EN_DEFDEVADR_ENABLE      ((uint32_t)0x00000200U)         /* !< When this bit is 1, default device
                                                                                    address of 7h110_0001 is always
                                                                                    matched by the Target address match
                                                                                    logic. */
/* UNICOMMI2CT_CTR[WUEN] Bits */
#define UNICOMMI2CT_CTR_WUEN_OFS                 (21)                            /* !< WUEN Offset */
#define UNICOMMI2CT_CTR_WUEN_MASK                ((uint32_t)0x00200000U)         /* !< Target Wakeup Enable */
#define UNICOMMI2CT_CTR_WUEN_DISABLE             ((uint32_t)0x00000000U)         /* !< When 0, the Target is not allowed
                                                                                    to clock stretch on START detection */
#define UNICOMMI2CT_CTR_WUEN_ENABLE              ((uint32_t)0x00200000U)         /* !< When 1, the Target is allowed to
                                                                                    clock stretch on START detection and
                                                                                    wait for faster clock to be
                                                                                    abvailable. This allows clean wake up
                                                                                    support for I2C in low power mode use
                                                                                    cases */
/* UNICOMMI2CT_CTR[SUSPEND] Bits */
#define UNICOMMI2CT_CTR_SUSPEND_OFS              (11)                            /* !< SUSPEND Offset */
#define UNICOMMI2CT_CTR_SUSPEND_MASK             ((uint32_t)0x00000800U)         /* !< Suspend external communication */
#define UNICOMMI2CT_CTR_SUSPEND_DISABLE          ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define UNICOMMI2CT_CTR_SUSPEND_ENABLE           ((uint32_t)0x00000800U)         /* !< External communication suspended */

