zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_unicommi2ct.h
/* UNICOMMI2CT_ACKCTL Bits */
/* UNICOMMI2CT_ACKCTL[ACKOEN] Bits */
#define UNICOMMI2CT_ACKCTL_ACKOEN_OFS            (0)                             /* !< ACKOEN Offset */
#define UNICOMMI2CT_ACKCTL_ACKOEN_MASK           ((uint32_t)0x00000001U)         /* !< I2C Target ACK Override Enable
                                                                                    Read SR.ACKOEN to check current
                                                                                    status of this bit */
#define UNICOMMI2CT_ACKCTL_ACKOEN_DISABLE        ((uint32_t)0x00000000U)         /* !< A response in not provided. */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ENABLE         ((uint32_t)0x00000001U)         /* !< An ACK or NACK is sent according to
                                                                                    the value written to the ACKOVAL bit. */
/* UNICOMMI2CT_ACKCTL[ACKOVAL] Bits */
#define UNICOMMI2CT_ACKCTL_ACKOVAL_OFS           (1)                             /* !< ACKOVAL Offset */
#define UNICOMMI2CT_ACKCTL_ACKOVAL_MASK          ((uint32_t)0x00000002U)         /* !< ACK Override Value Note: for
                                                                                    General Call this bit will be ignored
                                                                                    if set to NACK and Target continues
                                                                                    to receive data. */
#define UNICOMMI2CT_ACKCTL_ACKOVAL_DISABLE       ((uint32_t)0x00000000U)         /* !< An ACK is sent indicating valid
                                                                                    data or command. */
#define UNICOMMI2CT_ACKCTL_ACKOVAL_ENABLE        ((uint32_t)0x00000002U)         /* !< A NACK is sent indicating invalid
                                                                                    data or command. */
/* UNICOMMI2CT_ACKCTL[ACKOEN_ON_START] Bits */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_OFS   (2)                             /* !< ACKOEN_ON_START Offset */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_MASK  ((uint32_t)0x00000004U)         /* !< When set this bit will
                                                                                    automatically enable target override
                                                                                    acknowlede following a Start
                                                                                    Condition. Status bit ACKOEN will
                                                                                    reflect a value of '1' when automatic
                                                                                    override enable is used. */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_START_ENABLE ((uint32_t)0x00000004U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following a Start
                                                                                    Condition. */
/* UNICOMMI2CT_ACKCTL[ACKOEN_ON_PECNEXT] Bits */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_OFS (3)                             /* !< ACKOEN_ON_PECNEXT Offset */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_MASK ((uint32_t)0x00000008U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    acknowledge override following a
                                                                                    ACK/NACK of the byte received just
                                                                                    prior to the PEC byte.  However,
                                                                                    setting ACKCTL.ACKOEN bit will not
                                                                                    automatically be ACKed/NACKed by the
                                                                                    State Machine and firmware must
                                                                                    perform this function by writing
                                                                                    Target.ACKCTL register.  Status bit
                                                                                    ACKOEN will reflect a value of '1'
                                                                                    when automatic override enable is
                                                                                    used. */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECNEXT_ENABLE ((uint32_t)0x00000008U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the byte received just prior to
                                                                                    the PEC byte. Note that when ACKOEN
                                                                                    is set the PEC byte will not
                                                                                    automatically be ACKed/NACKed by the
                                                                                    State Machine and FW must perform
                                                                                    this function by writing
                                                                                    Target_SACKCTL. */
/* UNICOMMI2CT_ACKCTL[ACKOEN_ON_PECDONE] Bits */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_OFS (4)                             /* !< ACKOEN_ON_PECDONE Offset */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_MASK ((uint32_t)0x00000010U)         /* !< When set, this bit will
                                                                                    automatically turn on target
                                                                                    acknowledge enable field following
                                                                                    the ACK/NACK of the received PEC
                                                                                    byte. Status bit ACKOEN will reflect
                                                                                    a value of '1' when automatic
                                                                                    override enable is used. */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_DISABLE ((uint32_t)0x00000000U)         /* !< No special behavior */
#define UNICOMMI2CT_ACKCTL_ACKOEN_ON_PECDONE_ENABLE ((uint32_t)0x00000010U)         /* !< When set this bit will
                                                                                    automatically turn on the Target
                                                                                    ACKOEN field following the ACK/NACK
                                                                                    of the received PEC byte. */

/* UNICOMMI2CT_SR Bits */
/* UNICOMMI2CT_SR[RREQ] Bits */
#define UNICOMMI2CT_SR_RREQ_OFS                  (0)                             /* !< RREQ Offset */
#define UNICOMMI2CT_SR_RREQ_MASK                 ((uint32_t)0x00000001U)         /* !< Receive Request */
#define UNICOMMI2CT_SR_RREQ_CLEARED              ((uint32_t)0x00000000U)         /* !< No outstanding receive data. */
#define UNICOMMI2CT_SR_RREQ_SET                  ((uint32_t)0x00000001U)         /* !< Module has outstanding receive data
                                                                                    and is using clock stretching to
                                                                                    delay the Controller until the data
                                                                                    has been read from the RXDATA FIFO
                                                                                    (RX FIFO is full). */
/* UNICOMMI2CT_SR[TREQ] Bits */
#define UNICOMMI2CT_SR_TREQ_OFS                  (1)                             /* !< TREQ Offset */
#define UNICOMMI2CT_SR_TREQ_MASK                 ((uint32_t)0x00000002U)         /* !< Transmit Request */
#define UNICOMMI2CT_SR_TREQ_CLEARED              ((uint32_t)0x00000000U)         /* !< No outstanding transmit request. */
#define UNICOMMI2CT_SR_TREQ_SET                  ((uint32_t)0x00000002U)         /* !< I2C Target is addressed as a
                                                                                    transmitter and is using clock
                                                                                    stretching to delay the Controller
                                                                                    until data has been written to the
                                                                                    TXDATA FIFO (TX FIFO is empty). */
/* UNICOMMI2CT_SR[OAR2SEL] Bits */
#define UNICOMMI2CT_SR_OAR2SEL_OFS               (3)                             /* !< OAR2SEL Offset */
#define UNICOMMI2CT_SR_OAR2SEL_MASK              ((uint32_t)0x00000008U)         /* !< OAR2 Address Matched This bit gets
                                                                                    reevaluated after every address
                                                                                    comparison. */
#define UNICOMMI2CT_SR_OAR2SEL_CLEARED           ((uint32_t)0x00000000U)         /* !< Either the OAR2 address is not
                                                                                    matched or the match is in legacy
                                                                                    mode. */
#define UNICOMMI2CT_SR_OAR2SEL_SET               ((uint32_t)0x00000008U)         /* !< OAR2 address matched and ACKed by
                                                                                    the Target. */
/* UNICOMMI2CT_SR[QCMDST] Bits */
#define UNICOMMI2CT_SR_QCMDST_OFS                (4)                             /* !< QCMDST Offset */
#define UNICOMMI2CT_SR_QCMDST_MASK               ((uint32_t)0x00000010U)         /* !< Quick Command Status Value
                                                                                    Description: 0: The last transaction
                                                                                    was a normal transaction or a
                                                                                    transaction has not occurred. 1: The
                                                                                    last transaction was a Quick Command
                                                                                    transaction */
#define UNICOMMI2CT_SR_QCMDST_CLEARED            ((uint32_t)0x00000000U)         /* !< The last transaction was a normal
                                                                                    transaction or a transaction has not
                                                                                    occurred. */
#define UNICOMMI2CT_SR_QCMDST_SET                ((uint32_t)0x00000010U)         /* !< The last transaction was a Quick
                                                                                    Command transaction. */
/* UNICOMMI2CT_SR[QCMDRW] Bits */
#define UNICOMMI2CT_SR_QCMDRW_OFS                (5)                             /* !< QCMDRW Offset */
#define UNICOMMI2CT_SR_QCMDRW_MASK               ((uint32_t)0x00000020U)         /* !< Quick Command Read / Write  This
                                                                                    bit only has meaning when the QCMDST
                                                                                    bit is set.  Value Description: 0:
                                                                                    Quick command was a write 1: Quick
                                                                                    command was a read */
#define UNICOMMI2CT_SR_QCMDRW_CLEARED            ((uint32_t)0x00000000U)         /* !< Quick command was a write */
#define UNICOMMI2CT_SR_QCMDRW_SET                ((uint32_t)0x00000020U)         /* !< Quick command was a read */
/* UNICOMMI2CT_SR[RXMODE] Bits */
#define UNICOMMI2CT_SR_RXMODE_OFS                (2)                             /* !< RXMODE Offset */
#define UNICOMMI2CT_SR_RXMODE_MASK               ((uint32_t)0x00000004U)         /* !< Target FSM is in Rx MODE */
#define UNICOMMI2CT_SR_RXMODE_CLEARED            ((uint32_t)0x00000000U)         /* !< The Target State Machine is not in
                                                                                    the RX_DATA, RX_ACK, RX_WAIT,
                                                                                    RX_ACK_WAIT or ADDR_ACK state with
                                                                                    the bus direction set to write. */
#define UNICOMMI2CT_SR_RXMODE_SET                ((uint32_t)0x00000004U)         /* !< The Target State Machine is in the
                                                                                    RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT
                                                                                    or ADDR_ACK state with the bus
                                                                                    direction set to write. */
/* UNICOMMI2CT_SR[BUSBSY] Bits */
#define UNICOMMI2CT_SR_BUSBSY_OFS                (6)                             /* !< BUSBSY Offset */
#define UNICOMMI2CT_SR_BUSBSY_MASK               ((uint32_t)0x00000040U)         /* !< I2C bus is busy */
#define UNICOMMI2CT_SR_BUSBSY_CLEARED            ((uint32_t)0x00000000U)         /* !< The I2C Bus is not busy */
#define UNICOMMI2CT_SR_BUSBSY_SET                ((uint32_t)0x00000040U)         /* !< The I2C Bus is busy. This is
                                                                                    cleared on a timeout. */
/* UNICOMMI2CT_SR[TXMODE] Bits */
#define UNICOMMI2CT_SR_TXMODE_OFS                (7)                             /* !< TXMODE Offset */
#define UNICOMMI2CT_SR_TXMODE_MASK               ((uint32_t)0x00000080U)         /* !< FSM is in TX MODE */
#define UNICOMMI2CT_SR_TXMODE_CLEARED            ((uint32_t)0x00000000U)         /* !< State Machine is not in TX_DATA,
                                                                                    TX_WAIT, TX_ACK  or ADDR_ACK state
                                                                                    with the bus direction set to read. */
#define UNICOMMI2CT_SR_TXMODE_SET                ((uint32_t)0x00000080U)         /* !< State Machine is in TX_DATA,
                                                                                    TX_WAIT, TX_ACK  or ADDR_ACK state
                                                                                    with the bus direction set to read. */
/* UNICOMMI2CT_SR[STALE_TXFIFO] Bits */
#define UNICOMMI2CT_SR_STALE_TXFIFO_OFS          (8)                             /* !< STALE_TXFIFO Offset */
#define UNICOMMI2CT_SR_STALE_TXFIFO_MASK         ((uint32_t)0x00000100U)         /* !< Stale Tx FIFO */
#define UNICOMMI2CT_SR_STALE_TXFIFO_CLEARED      ((uint32_t)0x00000000U)         /* !< Tx FIFO is not stale */
#define UNICOMMI2CT_SR_STALE_TXFIFO_SET          ((uint32_t)0x00000100U)         /* !< The TX FIFO is stale. This occurs
                                                                                    when the TX FIFO was not emptied
                                                                                    during the previous I2C transaction. */
/* UNICOMMI2CT_SR[ADDRMATCH] Bits */
#define UNICOMMI2CT_SR_ADDRMATCH_OFS             (16)                            /* !< ADDRMATCH Offset */
#define UNICOMMI2CT_SR_ADDRMATCH_MASK            ((uint32_t)0x03FF0000U)         /* !< Indicates the address for which
                                                                                    Target address match happened */
#define UNICOMMI2CT_SR_ADDRMATCH_MINIMUM         ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define UNICOMMI2CT_SR_ADDRMATCH_MAXIMUM         ((uint32_t)0x03FF0000U)         /* !< Maximum Value */
/* UNICOMMI2CT_SR[RXCLR] Bits */
#define UNICOMMI2CT_SR_RXCLR_OFS                 (9)                             /* !< RXCLR Offset */
#define UNICOMMI2CT_SR_RXCLR_MASK                ((uint32_t)0x00000200U)         /* !< RX FIFO Clear Status */
#define UNICOMMI2CT_SR_RXCLR_CLEARED             ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define UNICOMMI2CT_SR_RXCLR_SET                 ((uint32_t)0x00000200U)         /* !< FIFO clear is complete */
/* UNICOMMI2CT_SR[TXCLR] Bits */
#define UNICOMMI2CT_SR_TXCLR_OFS                 (10)                            /* !< TXCLR Offset */
#define UNICOMMI2CT_SR_TXCLR_MASK                ((uint32_t)0x00000400U)         /* !< TX FIFO Clear Status */
#define UNICOMMI2CT_SR_TXCLR_CLEARED             ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define UNICOMMI2CT_SR_TXCLR_SET                 ((uint32_t)0x00000400U)         /* !< FIFO clear is complete */
/* UNICOMMI2CT_SR[RXFE] Bits */
#define UNICOMMI2CT_SR_RXFE_OFS                  (11)                            /* !< RXFE Offset */
#define UNICOMMI2CT_SR_RXFE_MASK                 ((uint32_t)0x00000800U)         /* !< Receive FIFO Empty  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define UNICOMMI2CT_SR_RXFE_CLEARED              ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define UNICOMMI2CT_SR_RXFE_SET                  ((uint32_t)0x00000800U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the receive FIFO is empty. */
/* UNICOMMI2CT_SR[RXFF] Bits */
#define UNICOMMI2CT_SR_RXFF_OFS                  (12)                            /* !< RXFF Offset */
#define UNICOMMI2CT_SR_RXFF_MASK                 ((uint32_t)0x00001000U)         /* !< Receive FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define UNICOMMI2CT_SR_RXFF_CLEARED              ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define UNICOMMI2CT_SR_RXFF_SET                  ((uint32_t)0x00001000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* UNICOMMI2CT_SR[TXFE] Bits */
#define UNICOMMI2CT_SR_TXFE_OFS                  (13)                            /* !< TXFE Offset */
#define UNICOMMI2CT_SR_TXFE_MASK                 ((uint32_t)0x00002000U)         /* !< Transmit FIFO Empty  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define UNICOMMI2CT_SR_TXFE_CLEARED              ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define UNICOMMI2CT_SR_TXFE_SET                  ((uint32_t)0x00002000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is empty. */
/* UNICOMMI2CT_SR[TXFF] Bits */
#define UNICOMMI2CT_SR_TXFF_OFS                  (14)                            /* !< TXFF Offset */
#define UNICOMMI2CT_SR_TXFF_MASK                 ((uint32_t)0x00004000U)         /* !< Transmit FIFO Full  The meaning of
                                                                                    this bit depends on the state of the
                                                                                    FEN bit in the CTL0 register. */
#define UNICOMMI2CT_SR_TXFF_CLEARED              ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define UNICOMMI2CT_SR_TXFF_SET                  ((uint32_t)0x00004000U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */
/* UNICOMMI2CT_SR[ACKOEN] Bits */
#define UNICOMMI2CT_SR_ACKOEN_OFS                (15)                            /* !< ACKOEN Offset */
#define UNICOMMI2CT_SR_ACKOEN_MASK               ((uint32_t)0x00008000U)         /* !< Status of ACK Override Enable */
#define UNICOMMI2CT_SR_ACKOEN_DISABLE            ((uint32_t)0x00000000U)         /* !< ACK override is disabled */
#define UNICOMMI2CT_SR_ACKOEN_ENABLE             ((uint32_t)0x00008000U)         /* !< ACK override was enabled in design */

